# Найти сумму ряда чисел от 1 до 100. Полученный результат вывести на экран.

summa = 0
count = 0
while count <= 100:
    summa += count
    count += 1
print(summa)
