# Найти произведение ряда чисел от 1 до 10. Полученный результат вывести на экран.

summa = 1
count = 1
while count <= 10:
    summa *= count
    count += 1
print(summa)
