# Вывести цифры числа на каждой строчке.

x = int(input())
for i in str(x):
    print(i)
